In [41]:
import pandas as pd
import numpy as np

In [42]:
names=['Mary', 'John','Bob','Mel','Jen','Sue','Ken','Dev','Dave','Beth','Ray']
payrt=[15,22,35,43,17,29,40,20,37,16.50]
hrs_worked=[40,25,4,62,33,45,36,17,37,80]
data_table=list(zip(names,salary,hrs_worked))
initial_df=pd.DataFrame(data=data_table, columns=['names','payrt','hrs_worked'])
initial_df

  names  payrt  hrs_worked
0  Mary   15.0          40
1  John   22.0          25
2   Bob   35.0           4
3   Mel   43.0          62
4   Jen   17.0          33
5   Sue   29.0          45
6   Ken   40.0          36
7   Dev   20.0          17
8  Dave   37.0          37
9  Beth   16.5          80

In [43]:
initial_df['hrs_worked']

0    40
1    25
2     4
3    62
4    33
5    45
6    36
7    17
8    37
9    80
Name: hrs_worked, dtype: int64

In [53]:
for n in range(0,10):
    if hrs_worked[n]>40:
        extrahr=hrs_worked[n]-40
        extrapay=extrahr*1.5*payrt[n]
        pay=40*payrt[n]+extrapay
    elif hrs_worked[n]<=40:
        pay=hrs_worked[n]*payrt[n]
        
    print(names[n],pay)

Mary 600
John 550
Bob 140
Mel 3139.0
Jen 561
Sue 1377.5
Ken 1440
Dev 340
Dave 1369
Beth 1650.0